import re

stopword_dict = {
"수사":"NP",
"긍정지정사":"VCP",
"부정지정사":"VCN",
"보조용언":"VX",
"관형사":"MM",
"일반부사":"MAG",
"접속부사":"MAJ",
"감탄사":"IC",
"주격조사":"JKS", 
"보격조사":"JKC",
"관형격조사":"JKG",
"목적격조사":"JKO",
"부사격조사":"JKB",
"호격조사":"JKV",
"인용격조사":"JKQ",
"보격조사":"JX",
"접속조사":"JC",
"선어말어미":"EP",
"종결어미":"EF",
"연결어미":"EC",
"명사형전성어미":"ETN",
"관형형전성어미":"ETM",
"체언접두사":"XPN",
"명사파생접미사":"XSN",
"동사파생접미사":"XSV",
"형용사파생접미사":"XSA",
"마침표, 물음표, 느낌표":"SF",
"쉼표, 가운뎃점, 콜론, 빗금":"SP",
"따옴표, 괄호표, 줄표":"SS",
"줄임표":"SE",
"붙임표 (물결, 숨김, 빠짐)":"SO",
"분석불능범주":"NA",
"형용사":"VA",
"동사":"VV",
"숫자":"SN",
"의존명사":"NNB",
"수사":"NR",
"기타 기호 (논리 수학기호, 기호 등)":"SW",
"대명사":"NP",
"어근":"XR"}

sign_dict = {
	"일반명사":"NNG",
	"고유명사":"NNP",
	"영어":"SL",
	"한자":"SH"
}
single_stop = {
	"ㄱ","ㄲ","ㄴ",'ㄷ',"ㄸ","ㄹ","ㅁ",'ㅂ',"ㅃ","ㅅ","ㅆ","ㅇ","ㅈ","ㅉ","ㅊ","ㅋ","ㅌ","ㅍ","ㅎ",
	"ㅏ","ㅑ","ㅓ","ㅑ","ㅓ","ㅕ","ㅗ","ㅛ","ㅜ","ㅠ","ㅡ","ㅣ","ㅔ","ㅖ","ㅐ","ㅒ","ㅟ","ㅞ","ㅚ","ㅙ","ㅢ"
}

stop_set = {
"https", "http","목차","장단점","알아쳐먹게","www","com","원문보기",
"페미","냄져","한남","씨발",'섹스','개년','애미','애비','창녀','홍어','후빨','셋스','시발','보지','잠지','모텔','등신','빨통',"씨팔",'니미','엠창','틀딱','응디','놈현','느금','창년','걸레','보빨','니엄','콘돔',"걸레",'병신','빙신','갈보','섻스','쎅스','ㅅㅂ','ㅈㄹ','족같','붕알','부랄','무현','ㅆㅂ','ㅆ발','니앰','니엄','색기' ,'씨팔',"페미","냄져","한남","자댕이",'조팔',"씨발",'섹스','개년','개새끼','씹','셋스','느개비','좆','노무현',"느개비",'느금마','니애미','빠구리','시발년','시발새끼','느그앰','느그미','노무혐','빠9리','시발롬','시발련','창년','보빨러','사까시','걸레년','걸레련','보빨','4카시','사카시','봊','보전깨','니미','오피누','오피녀','고무통','이기야','놈딱','북딱','지잡','십색기','십색갸','십색꺄',"숨은요소","필수","가능은함","상황","많아봐야","봐야","많이","할바","높아봐야","능한한","사기전","가격어","있는계정","뜷려있","뚫려","뚫는","오래걸림","오래","걸림","알수","물건너간것","물건너","보면됨","ㅇㅇ","하셈","당장하셈","없는","추가","ㅅㅣㅋ","ㅇㅈ","ㅋㅋ","ㅎㅎ","느거매","마셈","나서","하고나서","깔고나서","차이","사이트","줄거임","상단","원문","asd","zxc","qwe","png","jpg","gif","hwp","doc","docx","xlsx","ppt","zip","rar","7z","exe","mp4","mp3","m4a","wav","wmv","ttf","대부분","래시","얘기","최소한","요약","특정","최근","이외","의외","여지","부분","취소","원본","중단","상대","리야","싸움","원인","yes","no","떄문에","때문에","이다","asd","asdf","ㅁㄴㅇㄹ","one","미만","변경","세트","여유","레이","공개","비공개","참조","무한","도중","칭찬","자체","하이","사용","관련"
}

h_stopwords = {'아하', '관계없이', '하게하다', '바꾸어서', '하는것이', '위하여', '지만', '두', '하려고하다', '오르다',
 '것들', '반대로', '따르', '자마자', '심지어', '끙끙', '놓', '연관되다', '얼마만큼', '그럼에도', '이로',
 '따라', '참', '거니와', '윙윙', '예를', '하겠는가', '서술한바와같이', '이천구', '어이', '그렇지', '하기보다는', '어떠한', '이용하여', '없', '저기', '아래윗', '설사', '어', '하지만', '몰라도', '힘입어', '듯하다', '삐걱', '편이', '마치', '시작하여', '실로', '하면', '여', '우에', '만들', '여부', '밖에', '한켠으로는', '아울러', '까지', '거의', '중에서', '해도', '임에', '통하', '결과에', '일단', '누가', '까닭에', '의해서', '이렇게되면', '가', '때문에', '딩동', '와', '허허', '이외에도', '각종', '이만큼', '그위에', '것과', '이러한', '라', '더라도', '당장', '동시에', '이르기까지', '정도의', '참나', '지경이다', '버금', '즉시', '이러이러하다', '잠깐', '하기만', '그렇', '그러니', '힘이', '각자', '형식으로', '줄은', '전자', '지말고', '그렇게', '댕그', '마저', '이때', '끼익', '얼마', '시간', '다소', '향하다', '이래', '잇따라', '하는것만', '또', '자기', '헉', '만은', '삐걱거리다', '다음에', '가서', '의해되다', '사람', '무슨', '봐라', '적', '같이', '사람들', '거바', '없고', '문제', '아이고', '된바에야', '어떤것들', '육', '꽈당', '해야한다', '할수있어', '토하다', '다수', '위에서', '사실', '다만', '하구나', '어기여차', '일곱', '경우', '방면으로', '상대적으로', '이천칠', '야', '총적으로', '등', '더군다나', '얼마든지', '아니다', '하더라도', '이상', '비슷하다', '이쪽', '가지', '지든지', '게우다', '비로소', '그럼', '그', '또한', '아이쿠', '전후', '일때', '저쪽', '때가', '약간', '그들', '겸사겸사', '구토하다', '하지마라', '할망정', '륙', '이유만으로', '봐', '여차', '이었다', '연이서', '바와같이', '얼마간', '게다가', '알', '어디', '뿐이다', '생각', '외에', '어느쪽', '영차', '자기집', '하', '하마터면', '월', '안다', '입각하여', '기준으로', '주', '응당', '곧', '관련이', '의거하여', '년', '그녀', '일지라도', '까지도', '등등', '삼', '만큼', '기타', '습니까', '그러면', '제각기', '시키다', '이지만', '만이', '한적이있다', '비교적', '뚝뚝', '않는다면', '되다', '따르는', '보이', '더불어', '헐떡헐떡', '오로지', '때', '그래서', '틀림없다', '나머지는', '데', '여기', '만약', '아홉', '설마', '되는', '만일', '할줄알다', '어느곳', '같다', '어찌됏든', '않다면', '그런', '바꾸어말하면', '할수있다', '이렇게', '근거하여', '이런', '둥둥', '근거로', '퍽', '할지라도', '사회', '얼마큼', '소생', '그래', '매번', '아무도', '고려하면', '들자면', '팔', '소리', '하고있었다', '번', '좋', '주저하지', '위하', '하느니', '과', '어찌', '하곤하였다', '몰랏다', '비걱거리다', '해봐요', '제', '하물며', '한다면', '모두', '앞에서', '알았어', '로부터', '그것', '쳇', '관한', '일것이다', '말하면', '예', '앞', '그때', '관계가', '양자', '하기에', '내', '점', '생각이다', '해서는', '단지', '엉엉', '쾅쾅', '대하면', '갖고말하자면', '영', '살', '부류의', '했어요', '정도', '까악', '인', '후', '졸졸', '대하여', '달려', '막론하고', '중의하나', '다른', '하는', '아무거나', '할뿐', '혹시', '다음으로', '와르르', '지', '하도록하다', '그러나', '놀라다', '지금', '외에도', '고로', '한데', '가령', '때문', '더', '저', '운운', '넷', '동안', '우리', '보드득', '보다더', '제외하고', '어째서', '보', '우선', '무릎쓰고', '어쩔수', '아이', '그런데', '우리들', '뿐만', '의해', '혹은', '점에서', '다시', '속', '으로', '어떤것', '할수록', '보는데서', '대해', '좍좍', '받', '할때', '여자', '없다', '모', '앗', '대로', '낼', '중', '타인', '이와같다면', '좋아', '일반적으로', '여덟', '알겠는가', '령', '너희들', '겨우', '구', '낫다', '퉤', '콸콸', '바꿔', '아니라', '하면된다', '이', '인젠', '즉', '오자마자', '더구나', '다를까', '요만한걸', '시키', '집', '저것만큼', '물론', '하는바', '아니면', '해도된다', '않으면', '바로', '어느', '따위', '관하여', '하나', '못하', '로', '이번', '비하면', '아야', '탕탕', '기점으로', '따라서', '여보시오', '두번째로', '들', '들면', '안된다', '예하면', '더욱이는', '결국', '있다', '우르르', '함께', '의', '진짜로', '왜냐하면', '남짓', '잘', '여전히', '그러므로', '이어서', '전부', '되', '와아', '아니', '어느해', '줄은모른다', '좀', '많', '아', '하고', '따름이다', '이럴정도로', '하든지', '메쓰겁다', '저희', '이천육', '향해서', '함으로써', '이유는', '오히려', '자', '으로서', '마저도', '입장에서', '과연', '않기', '기대여', '이와', '않다', '너', '시초에', '그중에서', '휘익', '펄렁', '허걱', '같', '그리고', '반드시', '못하다', '논하지', '크', '하다', '솨', '공동으로', '각각', '을', '향하여', '인하여', '의지하여', '만약에', '자신', '에', '할지언정', '그러니까', '붕붕', '오', '하지마', '줄', '씨', '개의치않고', '수', '까닭으로', '말하', '이천팔', '시각', '미치다', '것', '그래도', '및', '쓰여', '된이상', '흐흐', '어때', '일', '한마디', '이리하여', '아이구', '사', '생각하', '요컨대', '다시말하면', '아니었다면', '그만이다', '도달하다', '종합한것과같이', '이렇게말하자면', '같은', '여러분', '즈음하여', '요만한', '부터', '더욱더', '통하여', '하자마자', '하여야', '하게될것이다', '비록', '타다', '만', '오직', '이르다', '대하', '어떻게', '어느때', '해도좋다', '쪽으로', '그치지', '비길수', '하여금', '어떻', '휴', '불문하고', '본대로', '말하자면', '원', '헉헉', '응', '그에', '몇', '바꾸어말하자면', '되어', '어찌하여', '있', '아니나', '앞의것', '대해서', '다섯', '모르', '어찌됏어', '그저', '예컨대', '그런즉', '한항목', '혼자', '싶', '불구하고', '어떤', '할만하다', '년도', '이렇', '하기', '딱', '든간에', '언젠가', '어찌하든지', '무렵', '매', '툭', '뒤따라', '흥', '누구', '에서', '당신', '를', '무엇', '보면', '첫번째로', '뿐만아니라', '설령', '가까스로', '위해서', '어쨋든', '하기는한데', '하도록시키다', '해요', '셋', '답다', '소인', '않고', '말', '무엇때문에', '어떻해', '많은', '조차도', '차라리', '에게', '이것', '안녕하세요', '로써', '견지에서', '이곳', '허', '왜', '김에', '아이야', '쉿', '명', '이렇구나', '개', '잠시', '너희', '생각한대로', '나', '아니나다를가', '쿵', '전', '하하', '나오', '말할것도', '하면서', '한하다', '도착하다', '뒤이어', '습니다', '이봐', '어느것', '않도록', '그렇지않으면', '정도에', '마음대로', '이라면', '보아', '할', '그렇지만', '못하다하기보다는', '훨씬', '팍', '틈타', '저것', '관해서는','칠', '하도다', '하는것도', '각', '아니라면', '한', '조차', '조금', '언제', '얼마나', '요만큼', '네', '둘', '옆사람', '남들', '오호', '그러', '이젠', '하지', '다음', '으로써', '여섯', '비추어', '주룩주룩', '따지지', '그러한즉', '그리하여', '않', '구체적으로', '결론을', '안'}