#tagging 공통 함수에 쓰이는 분류
#조건 :::: tag_names 와 tag_names_board 에 요소는 서로 겹치면 안 된다.

#public 태그명 - 49
tag_names = ['IT&컴퓨터', '영어', '일본어', '중국어', '취업&진로', '창업', '장학', '행사', '공모전&대외활동', '세미나', '사이버강의', '수강', '멘토링', '모집', '스포츠', '과외&강사', '자취&하숙', '학식',\
 '알바&구인', '동아리&모임', '고민&상담', '독서퀴즈', '봉사', '졸업', '공개채용', '추천채용', '특별채용', '수시채용', '인턴', '계약직', '정규직', '회계', '조교', '디자인', '법무', 'FAQ', '소식',\
 '종교', '공지', '신입생', '학사', '국제', '여행', '교환학생', '수강편람', '게임', '식당', '거래&대여', '카페']

#게시판 개별 태그명 - 98
tag_names_board = ['입학', '경력', '신입', '기획', '기술직', '의료직', '교직', '마케팅', '조리직', '서비스직', '해외', '공모전&대외활동', '회계', '학술정보원', '박물관', '입찰', '방송국', '커뮤니티', '음악', '거래&대여',\
 '홍보원', '도서', '교내', '전화번호부', '네이버카페', '다음카페', '컴퓨터공학과', '물리천문학과', '영화예술학과', '역사학과', '공과대학', '환경에너지공간융합학과', '소프트웨어학과', '음악과', '만화애니메이션학과', '수학통계학부',\
  '국어문학과', '에너지자원공학과', '화학과', '전자정보공학대학', '기계항공우주공학부', '지능기전공학부', '중국통상학과', '경제통신학과', '데이터사이언스학과', '행정학과', '경영학부', '호텔관광대학', '전자정보통신공학과',\
   '정보보호학과', '나노신소재공학부', '국방시스템공학과', '산업디자인학과', '체육학과', '무용학과', '디자인이노베이션', '법학부', '국제학부', '영어영문학과', '일어일문학과',\
    'CK사업단', '교육학과', '미디어커뮤니케이션학과', '호텔관광외식경영학부', '호텔외식관광프랜차이즈경영학과', '글로벌조리학과', '생명시스템학부', '식품생명공학과', '바이오융합공학과', '바이오산업자원공학과', '건축공학과',\
     '건축학과', '건축공학부', '기계공학과', '항공우주공학과', '원자력공학과', '항공시스템공학과', '회화과', '패션디자인학과', '총학생회', '분실물', '위키백과', '연애', '세종냥이', '메이플스토리', '카트라이더',\
      '오버워치', '로스트아크', '방탄소년단', '건강', '작곡', '세종알리', '사이트', '행복기숙사', '세종대역', '두드림', '홍보', '전자도서관']

#단어=>태그화 (public 태그화)
List = {'IT&컴퓨터' : ["IT&컴퓨터", "웹개발/웹 개발/정보보호/정보보안/소프트웨어/프로그래머/프론트엔드/백엔드/카카오/KAKAO/로보틱스/컴퓨터/로직/IT/정보개발/웹 디자인/웹사이트/머신러닝/SW/시스템개발/\
시스템 개발/COMPUTING/음성합성/DBA/데이터베이스관리자/FRONT-END/BACK-END/AI/CF++/C언어/SOFTWARE/SE/데이터분석/데이터 분석/DATA ENGINEER/데이터엔지니어/데이터 엔지니어/JAVA/DATA ALALYST/ITSM/\
IOS/ANDROID/안드로이드/블록체인/앱개발/API/딥러닝/시스템개발/플랫폼 개발/게임/빅데이터/웹 디자이너/UX/UI/VR/인공지능/더존비즈온/그래픽/개발자/코딩/넥슨/아이폰/갤럭시/PYTHON/파이썬/HTML/웹페이지/웹 페이지\
해커톤/탑싯/TOPCIT/고급C/고급씨/PROGRAMMING"],\
		'영어': ["영어", "영어/영문/TOEIC/TOEFL/토익/토플/아이엘츠/IELTS/지텔프/GTELP/G-TELP/이시엘/이씨엘/ECL/OPI/오피아이/태슬/TESL/ESP/TEPS/텝스/TOSEL/토셀"],\
		'일본어': ["일본어", "일어/일본어/JPT/JLPT/OPIC/J-TEST/일본 한자/일본한자"],\
		'중국어': ["중국어", "중국어/HSK/TSC/BCT/OPIC/TCT"],\
		'취업&진로': ["취업&진로", "취업/진로/공개채용/공개 채용/공채/공개경쟁채용/추천채용/추천 채용/수시채용/수시 채용/특별채용/특별 채용/특채/일자리/채용"],\
		'창업': ["창업", "창업/스타트업/스타트 업/STARTUP"],\
		'장학': ["장학", "장학"],\
		'행사': ["행사", "행사/참가/프로그램/콘서트/공모전/포럼/힘미제/대동제/학술제/개최/대회/기념식/대회/축제/캠프/공연/박람회/페스티벌/파티/콘테스트/컨테스트/오리엔테이션/콘퍼런스/컨퍼런스"],\
		'공모전&대외활동': ["공모전&대외활동", "공모전/대외활동/프로젝트/대회/현장실습/장기연수/단기연수"],\
		'세미나': ["세미나", "세미나/워크샵/워크숍/설명회/특강/강연"],\
		'사이버강의': ["사이버강의", "싸강/사이버강의/E-러닝/이러닝/온라인강의/셀크/SELC/K-MOOC/KMOOC"],\
		'수강': ["수강", "수강/강의/강좌/계절학기/중핵/전공기초교양/교양과목/교필/중필/중핵필/전공과목/전필/전공필수/전공선택/전선과목/전선 과목/자유선택교양/자유교양"],\
		'멘토링': ["멘토링", "멘토/멘티/멘토링"],\
		'모집': ["모집", "모집"],\
		'스포츠': ["스포츠", "스포츠/레포츠/축구/운동/농구/야구/족구/수영/테니스/배드민턴/골프/레져/요트/체조/육상/볼링/스쿼시/요가/탁구/당구/클라이밍/선수촌"],\
		'과외&강사': ["과외&강사", "과외/강사/선생님/영어학원/수학학원/국어학원/과학학원/컴퓨터학원/튜터링"],\
		'자취&하숙': ["자취&하숙", "원룸/자취/자췻방/하숙/투룸"],\
		'학식': ["학식", "학식/군자식당/군자키친/군자의 밥상/학생회관 푸드코트/나루또/아지오/SUN상하이/진관키친/진관학식/군자학식/진관식당/스카이레스토랑/우정푸드코트/우정학식/더큰도시락/우정식당/\
군자 식당/군자 학식/진관 식당/진관 학식/진관 키친/군자 키친/우정 학식/우정 식당/학관 학식/학관 식당/소금구이덮밥/소구덮/두부찌개/회비빔밥/고치돈/고구마치즈돈까스/고구마치즈돈가스/덮밥"],\
		'알바&구인': ["알바&구인", "알바/구인/아르바이트/모집/급구"],\
		'동아리&모임': ["동아리&모임", "스터디/모임/동아리"],\
		'고민&상담': ["고민&상담", "고민/상담/걱정거리/컨설팅"],\
		'독서퀴즈': ["독서퀴즈", "독서퀴즈"],\
		'봉사': ["봉사", "봉사/세종나누리/나눔봉사단"],\
		'졸업': ["졸업", "졸업"],\
		'공개채용': ["공개채용", "공개채용/공채/공개 채용/공개경쟁채용"],\
		'추천채용': ["추천채용", "추천채용/추천 채용"],\
		'특별채용': ["특별채용", "특별채용/특별 채용/특채"],\
		'수시채용': ["수시채용", "수시채용/수시 채용"],\
		'인턴': ["인턴", "인턴"],\
		'계약직': ["계약직", "계약직"],\
		'정규직': ["정규직", "정규직"],\
		'회계': ["회계", "회계"],\
		'조교': ["조교", "조교"],\
		'디자인': ["디자인", "디자인/디자이너/VMD/ANIMATOR/애니메이터/원화가/모델러/일러스트/일러스터"],\
		'법무': ["법무", "법무/변호사/법률/법원/로펌"],\
		'FAQ': ["FAQ", "FAQ"],\
		'소식': ["소식", "뉴스/언론/NEWS/기사 / 기사/ 기사 "],\
		'종교': ["종교", "종교/예배/기독교/불교/천주교/힌두교/이슬람교/교회/성당"],\
		'공지' : ["공지", "공지/안내"],\
		'신입생' : ["신입생", "신입생/새내기"],\
		'학사' : ["학사", "학사/휴학/복학/연계전공/제2전공/복수전공/수강신청/등록금/학적변경/학적변동/교직신청/조기졸업/졸업적부/강좌조회/관심과목/수강철회/계절학기/수강포기/수강내역/수업계획서\
공결신청/채플강좌/공결내역/공결조회/수강조회/강의조회/기이수성적/당학기성적/학점포기/강의평가/장학이력/상담교수조회/수강변경/전공선택/교과과정/학사경고/학고"],\
		'국제' : ["국제", "교환학생/해외연수/어학연수/해외파견/장기연수/단기연수/유학"],\
		'여행' : ["여행", "여행/유스호스텔/유스 호스텔"],\
		'교환학생' : ["교환학생", "교환학생"],\
		'수강편람' : ["수강편람", "수강편람/LECTURE SCHEDULE"],\
		'게임' : ['게임', "게임/메이플스토리/MAPLESTORY/오버워치/OVERWATCH/리그오브/LEAGUEOF/LEAGUE OF/카트라이더/KARTRIDER/크레이지아케이드/CRAZYACADE/배그/배틀그라운드/BATTLEGROUND/검은사막/로스트아크/LOSTARK/LOST ARK/로스트 아크/크레이지 아케이드\
/GAME/리그 오브/피파 온라인/피파온라인/FIFA ONLINE/FIFAONLINE/피파4/피파3/FIFA4/FIFA3/서든어택/SUDDEN ATTACK/SUDDENATTACK/스타크래프트/STARCRAFT/워크래프트/WARCRAFT/블레이드/블소/리니지/LIEAGE/사이퍼즈/CYPHERS/아이온/AION/한게임/넥슨/넷마블/HANGAME/NEXON\
/NETMABLE/NCSOFT/엔씨소프트/컴투스/네오위즈/NEOWIZ/인벤"],\
		'식당' : ['식당', "식당/학식/군자식당/군자키친/군자의 밥상/학생회관 푸드코트/나루또/아지오/SUN상하이/진관키친/진관학식/군자학식/진관식당/스카이레스토랑/우정푸드코트/우정학식/더큰도시락/우정식당/\
군자 식당/군자 학식/진관 식당/진관 학식/진관 키친/군자 키친/우정 학식/우정 식당/학관 학식/학관 식당/석기시대/춘천닭갈비/춘천 닭갈비/장암칼국수/장안칼국수/장칼/부대찌개집/지그재그/밥버거/명량핫도그/와플그라네/와플그란데/\
와플 그란데/그라네/파스타집/파스타 집/한식집/양식집/중국집/빕스/VIPS/홍콩반점/피자스쿨/피자헛/도미노피자/깍둑/깎둑/마포갈매기/고기집/고깃집/장암사이/손수레치킨/손수레 치킨/썬더치킨/썬더 치킨/서브웨이/써브웨이/\
맥도널드/맥도날드/맥날/롯데리아/롯리/족발집/보쌈집/옹기종기/옹종/참새방앗간/참방/은혜떡볶이/뱃놈/또래끼리/김밥천국/곱창집/막창집/진미가/카레집"],\
		'거래&대여' : ['거래&대여', "거래/대여/구매/판매/팝니다/삽니다/팔아요/구입합니다/렌탈"],\
		'카페' : ['카페', "제주몰빵/팬도로시/펜도로시/컵안에버블/컵버/이디야/커피온리/커피온니/군자역 카페/세종대 카페/단지커피/그리네/초이고야/스타벅스/STARBUGS/EDIYA/바나나톡/BANANATALK/룸곡/퍼스트에스프레소/커피만/탐앤탐스/\
빽다방/백다방/투썸/TWOSOMEPLACE/랭스터디/홉슈/더착한커피/근처 카페/근처카페/주변카페/주변 카페/카페 추천/헨그/HOP CHOU/HOPCHOU/군자 카페/군자역카페/군자카페/세종대카페/어대카페/어대 카페/역 카페/역카페/헨그/카페 좋은/조용한 카페/\
좋은 카페/조용한 카페/이쁜 카페/괜찮은 카페/카페 일월십사일/일월십사일 카페/일월십사일카페/카페일월십사일/카페1월14일/카페 1월14일/1월14일 카페/1월14일카페/TAMNTOMS/TAM N TOMS/카페드림/PANDOROTHY/엔젤리너스/디저트 카페/디저트카페/\
커피베이/카페베네/CAFEBENE/커피빈/할리스/헨델과 그레텔"]
		}

#단어=>태그화 (게시판 개별 태그화)
List_board = {'입학' : ["입학", "입학"],\
			'경력' : ["경력", "경력"],\
			'신입' : ["신입", "신입"],\
			'기획' : ["기획", "기획/설계/PM"],\
			'기술직' : ["기술직", "엔지니어/ENGINEER/캐드/CAD/기술부/기술자/HW/정비/조립/용접/조작/전기공/세공/승강기/엘리베이터"],\
			'의료직' : ["의료직", "치과/치료사/보건/의료/의원/간호사/한의사/제약/병원/한약/의약품/약사/약물"],\
			'교직' : ["교직", "교직/강사/선생님"],\
			'마케팅' : ["마케팅", "영업/마케팅/세일즈맨"],\
			'조리직' : ["조리직", "일식/중식/한식/조리사/주방"],\
			'서비스직' : ["서비스직", "상담사/상담가/상담원/콜센터/미용실/미용사/관리사/배달/계산원/관리인/진행원/택배"],\
			'해외' : ["해외", "해외/미국/일본/중국/독일/삿포로/중화권/영어권/SJ GLOVAL JOBS/영미권/북미권/호주"],\
			'공모전&대외활동' : ["공모전&대외활동", "연수"],\
			'회계' : ["회계", "경리"],\
			'학술정보원' : ["학술정보원", "학술정보원/도서관"],\
			'박물관' : ["박물관", "박물관"],\
			'입찰' : ["입찰", "입찰"],\
			'방송국' : ["방송국", "방송국/SKBS"],\
			'커뮤니티' : ["커뮤니티", "커뮤니티/친목질/대인관계/인간관계"],\
			'음악' : ["음악", "음악/뮤직/MUSIC"],\
			'거래&대여' : ["거래&대여", "거래/대여/교환/구매/판매"],\
			'홍보원' : ["홍보원", "홍보원"],\
			'도서' : ["도서", "도서/독서"],\
			'교내' : ["교내", "교내"],\
			'전화번호부' : ["전화번호부", "전화번호/조교실번호/학과번호/조교실 번호/학과 번호/연구실번호/연구실 번호/행정실전화번호/행정실 전화번호"],\
			'네이버카페' : ["네이버카페", "네이버카페/네이버 카페/NAVERCAFE/NAVER CAFE"],\
			'다음카페' : ["다음카페", "다음카페/다음 카페/DAUMCAFE/DAUM CAFE"],\
			'컴퓨터공학과' : ["컴퓨터공학과", "컴퓨터공학과/컴공/컴퓨터학과/컴퓨터과"],\
			'물리천문학과' : ["물리천문학과", "물리천문학과/물리학과/천문학과"],\
			'영화예술학과' : ["영화예술학과", "영화예술학과/영예과"],\
			'역사학과' : ["역사학과", "역사학과"],\
			'공과대학' : ["공과대학", "공과대학/건설환경공학과/건축공학과/건축학과/환경에너지공간융합학과/에너지자원공학과/기항/기계공학과/기공과/우주공학과/항공학과/항공공학/항공과/우공과\
나노학과/나노신소재/원자력공학과/원공과/국방시스템공학과/국시공/우주공학과/항공학과/항공공학과/항공과/우공과/기항"],\
			'환경에너지공간융합학과' : ["환경에너지공간융합학과", "환경에너지공간융합학과/환공과"],\
			'소프트웨어학과' : ["소프트웨어학과", "소프트웨어학과/소웨과"],\
			'음악과' : ["음악과", "음악과"],\
			'만화애니메이션학과' : ["만화애니메이션학과", "만화애니메이션텍/애니매이션학과/만화애니매이션텍/애니메이션학과/만화과/만화학과/만화애니메이션과/만화애니매이션과/애니매이션과/애니메이션과/애니학과"],\
			'수학통계학부' : ["수학통계학부", "수학통계학/수통학과/통계학과"],\
			'국어문학과' : ["국어문학과", "국문/국어문학과"],\
			'에너지자원공학과' : ["에너지자원공학과", "에너지자원공학과"],\
			'화학과' : ["화학과", "화학과"],\
			'전자정보공학대학' : ["전자정보공학대학", "전자정보공학대학/전정대/전자정보통신공학과/디지털콘텐츠학과/디컨/디콘"],\
			'기계항공우주공학부' : ["기계항공우주공학부", "기항/기계공학과/기공과/우주공학과/항공학과/항공공학과/항공과/우공과"],\
			'지능기전공학부' : ["지능기전공학부", "지능기전공학과/지능기전공"],\
			'중국통상학과' : ["중국통상학과", "중국통상학과/중통과/중통학과"],\
			'경제통신학과' : ["경제통신학과", "경제통신학과"],\
			'데이터사이언스학과' : ["데이터사이언스학과", "데이터사이언스학과/데사과/데싸"],\
			'행정학과' : ["행정학과", "행정학과"],\
			'경영학부' : ["경영학부", "경영학부/경영학과"],\
			'호텔관광대학' : ["호텔관광대학", "호텔관광대학/호관대/호텔관광/호텔외식관광프랜차이즈경영학과/호텔외식비지니스학과/글로벌조리학과/호텔경영학과"],\
			'전자정보통신공학과' : ["전자정보통신공학과", "전자정보통신공학과/전정통"],\
			'정보보호학과' : ["정보보호학과", "정보보호학과/정보보호과/정보과"],\
			'나노신소재공학부' : ["나노신소재공학부", "나노학과/나노신소재"],\
			'국방시스템공학과' : ["국방시스템공학과", "국방시스템공학과/국시공"],\
			'산업디자인학과' : ["산업디자인학과", "산업디자인학과/산디과/디자인학과/디자인과"],\
			'체육학과' : ["체육학과", "체육학과/체육과"],\
			'무용학과' : ["무용학과", "무용학과/무용과"],\
			'디자인이노베이션' : ["디자인이노베이션", "디자인이노베이션학과/디자인학과/디자인과/디자인이노베이션"],\
			'법학부' : ["법학부", "법학과/법학부"],\
			'국제학부' : ["국제학부", "국제학부/영어영문학/일어일문학/중국통상학/CK사업단/국제학과"],\
			'영어영문학과' : ["영어영문학과", "영어영문학과/영어과/영문과/영어학과/영문학과"],\
			'일어일문학과' : ["일어일문학과", "일어일문학과/일어과/일어학과/일문학과"],\
			'CK사업단' : ["CK사업단", "CK사업단"],\
			'교육학과' : ["교육학과", "교육학과"],\
			'미디어커뮤니케이션학과' : ["미디어커뮤니케이션학과", "미디어커뮤니케이션학과/커뮤니케이션학과/미디어커뮤니케이션학과"],\
			'호텔관광외식경영학부' : ["호텔관광외식경영학부", "외식경영학과/호외과/호텔관광대학/호관대"],\
			'호텔외식관광프랜차이즈경영학과' : ["호텔외식관광프랜차이즈경영학과", "호텔외식관광프랜차이즈경영학과/호관경영학과/호텔경영학과/호텔관광대학/호관대"],\
			'글로벌조리학과' : ["글로벌조리학과", "글로벌조리학과/호관대조리학과/호텔관광대학조리학과/호텔관광대학/호관대"],\
			'생명시스템학부' : ["생명시스템학부", "생명시스템학과/생시학부/식품생명공학과/바이오융합공학과/바이오산업자원공학과/식생과/식생학과/식품생명공학과/바이오융합공학과/\
바이오산업자원공학과/바이오자원공학과/바이오공학과"],\
			'식품생명공학과' : ["식품생명공학과", "식품생명공학과/식생과/식생학과"],\
			'바이오융합공학과' : ["바이오융합공학과", "바이오융합공학과/바이오공학과"],\
			'바이오산업자원공학과' : ["바이오산업자원공학과", "바이오산업자원공학과/바이오자원공학과/바이오공학과"],\
			'건축공학과' : ["건축공학과", "건축공학과/건공"],\
			'건축학과' : ["건축학과", "건축학과"],\
			'건축공학부' : ["건축공학부", "건축공학과/건축학과/건공"],\
			'기계공학과' : ["기계공학과", "기계공학과/기공과/기항/기계항공우주공학과"],\
			'항공우주공학과' : ["항공우주공학과", "항공우주공학과/우주공학과/항공학과/항공공학과/항공과/우공과/기항"],\
			'원자력공학과' : ["원자력공학과", "원자력공학과/원공과"],\
			'항공시스템공학과' : ["항공시스템공학과", "항공시스템공학과/항시공"],\
			'회화과' : ["회화과", "회화과"],\
			'패션디자인학과' : ["패션디자인학과", "패션디자인학과/패디과/패디"],\
			'총학생회' : ["총학생회", "총학생회/총학/띵동"],\
			'분실물' : ["분실물", "분실물/유실물/습득물"],\
			'위키백과' : ["위키백과", "위키백과/세종대백과/세종백과"],\
			'연애' : ["연애", "연애/사랑/썸"],\
			'세종냥이' : ["세종냥이", "세종냥이/세종대고양이/세종대 고양이"],\
			'메이플스토리' : ["메이플스토리", "메이플스토리/MAPLESTORY"],\
			'카트라이더' : ["카트라이더", "카트라이더/KARTRIDER/카트 같이"],\
			'오버워치' : ["오버워치", "오버워치/OVERWATCH/옵치"],\
			'로스트아크' : ["로스트아크", "로스트아크/LOST ARK/LOSTARK/로아"],\
			'방탄소년단' : ["방탄소년단", "방탄소년단/BTS"],\
			'건강' : ["건강", "건강/다이어트"],\
			'작곡' : ["작곡", "작곡"],\
			'세종알리' : ["세종알리", "세종알리/세종 알리/알리이야기"],\
			'사이트' : ["사이트", "사이트"],\
			'행복기숙사' : ["행복기숙사", "행복기숙사/긱사/새날관"],\
			'세종대역' : ["세종대역", "세종대역"],\
			'두드림' : ["두드림", "두드림/DODREAM/비교과프로그램"],\
			'홍보' : ["홍보", "홍보"],\
			'전자도서관' : ["전자도서관", "전자도서관/디지털도서관/학술정보원도서관"]\
			}